export const PHOTOS_QUANTITY = 25;
export const LIKES_MIN_QUANTITY = 15;
export const LIKES_MAX_QUANTITY = 200;
export const COMMENTS_MIN_QUANTITY = 0;
export const COMMENTS_MAX_QUANTITY = 30;
export const COMMENT_MESSAGES_MIN_QUANTITY = 1;
export const COMMENT_MESSAGES_MAX_QUANTITY = 2;
export const AVATAR_MIN_ID = 1;
export const AVATAR_MAX_ID = 6;
export const MINUTES_IN_HOUR = 60;
export const COMMENTS_PER_VIEW = 5;
export const ESC_KEY_NAME = 'Escape';
export const MAX_COMMENT_LENGTH = 140;
export const MAX_HASHTAG_COUNT = 5;
export const HASHTAG_PATTERN = /^#[a-zа-яё0-9]{1,19}$/i;
export const SCALE_STEP = 25;
export const MIN_SCALE = 25;
export const MAX_SCALE = 100;
export const DEFAULT_SCALE = 100;
export const BASE_API_URL = 'https://31.javascript.htmlacademy.pro/kekstagram';
export const DATA_ERROR_SHOW_TIME = 5000;

export const DESCRIPTIONS = [
  'Лучший день в моей жизни!',
  'Закат на пляже 🌅',
  'Когда море — твой лучший друг.',
  'Невероятные приключения в горах.',
  'Просто момент счастья.',
  'Случайный кадр, но такой атмосферный!',
  'Поймал идеальный свет.',
  'Моя любимая фотография ❤️',
  'Душа требует красоты.',
  'Фотография, которая говорит сама за себя.'
];

export const COMMENT_MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

export const NAMES = [
  'Артём', 'Илья', 'Мария', 'София', 'Александр', 'Виктория', 'Дмитрий',
  'Полина', 'Сергей', 'Екатерина', 'Алина', 'Роман', 'Кирилл', 'Олег'
];

